ImperialSpaceSociety/PicoTracker/tests/stm8_compat/iostm8s003f3.h
/* Compile-only compatibility shim for the SDCC structural STM8 check.
 * Register names intentionally map to a dummy lvalue; this is not hardware firmware. */
#ifndef STM8_STUB_H
#define STM8_STUB_H
#include <stdint.h>
extern volatile uint8_t stm8_reg8;
#define AWU_APR_APR stm8_reg8
#define AWU_CSR1 stm8_reg8
#define AWU_CSR1_AWUEN stm8_reg8
#define AWU_TBR stm8_reg8
#define AWU_TBR_AWUTB stm8_reg8
#define CLK_CCOR stm8_reg8
#define CLK_CKDIVR stm8_reg8
#define CLK_ECKR stm8_reg8
#define CLK_HSITRIMR stm8_reg8
#define CLK_ICKR stm8_reg8
#define CLK_ICKR_FHW stm8_reg8
#define CLK_ICKR_HSIEN stm8_reg8
#define CLK_ICKR_HSIRDY stm8_reg8
#define CLK_ICKR_LSIEN stm8_reg8
#define CLK_ICKR_REGAH stm8_reg8
#define CLK_PCKENR1 stm8_reg8
#define CLK_PCKENR2 stm8_reg8
#define CLK_SWCR stm8_reg8
#define CLK_SWCR_SWBSY stm8_reg8
#define CLK_SWCR_SWEN stm8_reg8
#define CLK_SWIMCCR stm8_reg8
#define CLK_SWR stm8_reg8
#define MASK_PC_IDR_IDR7 stm8_reg8
#define PA_CR1_C13 stm8_reg8
#define PA_CR2_C23 stm8_reg8
#define PA_DDR_DDR3 stm8_reg8
#define PA_ODR_ODR3 stm8_reg8
#define PB_CR1_C14 stm8_reg8
#define PB_CR2_C24 stm8_reg8
#define PB_DDR_DDR4 stm8_reg8
#define PC_CR1_C13 stm8_reg8
#define PC_CR1_C15 stm8_reg8
#define PC_CR1_C16 stm8_reg8
#define PC_CR1_C17 stm8_reg8
#define PC_CR2_C23 stm8_reg8
#define PC_CR2_C25 stm8_reg8
#define PC_CR2_C26 stm8_reg8
#define PC_CR2_C27 stm8_reg8
#define PC_DDR_DDR3 stm8_reg8
#define PC_DDR_DDR5 stm8_reg8
#define PC_DDR_DDR6 stm8_reg8
#define PC_DDR_DDR7 stm8_reg8
#define PC_IDR stm8_reg8
#define PC_ODR_ODR3 stm8_reg8
#define PC_ODR_ODR5 stm8_reg8
#define PC_ODR_ODR6 stm8_reg8
#define PD_CR1_C12 stm8_reg8
#define PD_CR1_C13 stm8_reg8
#define PD_CR1_C14 stm8_reg8
#define PD_CR2_C22 stm8_reg8
#define PD_CR2_C23 stm8_reg8
#define PD_CR2_C24 stm8_reg8
#define PD_DDR_DDR2 stm8_reg8
#define PD_DDR_DDR3 stm8_reg8
#define PD_DDR_DDR4 stm8_reg8
#define PD_ODR_ODR2 stm8_reg8
#define PD_ODR_ODR3 stm8_reg8
#define PD_ODR_ODR4 stm8_reg8
#define TIM1_ARRH stm8_reg8
#define TIM1_ARRL stm8_reg8
#define TIM1_CR1_CEN stm8_reg8
#define TIM1_IER_UIE stm8_reg8
#define TIM1_PSCRH stm8_reg8
#define TIM1_PSCRL stm8_reg8
#define TIM1_SR1_UIF stm8_reg8
#define UART1_BRR1 stm8_reg8
#define UART1_BRR2 stm8_reg8
#define UART1_CR1 stm8_reg8
#define UART1_CR1_M stm8_reg8
#define UART1_CR1_PCEN stm8_reg8
#define UART1_CR1_UART0 stm8_reg8
#define UART1_CR2 stm8_reg8
#define UART1_CR2_ILIEN stm8_reg8
#define UART1_CR2_REN stm8_reg8
#define UART1_CR2_RIEN stm8_reg8
#define UART1_CR2_TCIEN stm8_reg8
#define UART1_CR2_TEN stm8_reg8
#define UART1_CR2_TIEN stm8_reg8
#define UART1_CR3 stm8_reg8
#define UART1_CR3_CPHA stm8_reg8
#define UART1_CR3_CPOL stm8_reg8
#define UART1_CR3_LBCL stm8_reg8
#define UART1_CR3_STOP stm8_reg8
#define UART1_CR4 stm8_reg8
#define UART1_CR5 stm8_reg8
#define UART1_DR stm8_reg8
#define UART1_GTR stm8_reg8
#define UART1_PSCR stm8_reg8
#define UART1_SR stm8_reg8
#define UART1_SR_RXNE stm8_reg8
#define UART1_SR_TXE stm8_reg8
#define UART1_TX stm8_reg8
#define AWU_vector 0
#define TIM1_OVR_UIF_vector 0
#endif
